tap "hashicorp/tap"
tap "jesseduffield/lazygit"
tap "samtay/tui"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern, maintained replacement for ls
brew "eza"
# GitHub command-line tool
brew "gh"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Theme for zsh
brew "powerlevel10k"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
cask "font-meslo-lg-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Clipboard manager
cask "maccy"
# Collaboration platform for API development
cask "postman"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "manishsencha.readme-preview"
vscode "mikestead.dotenv"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wesbos.theme-cobalt2"
vscode "yoavbls.pretty-ts-errors"
npm "@anthropic-ai/claude-code"
npm "corepack"
